Documents/упУстановкаНормРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упУстановкаНормРасходаГСМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упНормыРасходаРежимовРаботы</xr:Item>
				<xr:Item>InformationRegister.упНормыРасходаГСМ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНормРасходаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОбъектыНормРасходаГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыДополнительногоОборудования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительноеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходИзСобственногоБака</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНормыРасходаГСМ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыНормРасходаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменениеРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаЗимний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗимний</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаКондиционер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходКондиционер</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаОтопитель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходОтопитель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаДлительнаяЭксплуатация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходДлительнаяЭксплуатация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаТемпературныхКоэффициентов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упОценочнаяШкала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходРабочаяОперация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаРабочаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРежимовРаботыДополнительногоОборудования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упРежимыРаботыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыТранспортныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменениеРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходГорнаяМестность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходГрузовой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходДлительнаяЭксплуатация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗимний</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходКлиматКонтроль</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходКондиционер</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходНаселенныйПункт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходОтопитель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходПростой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходСложностьДорог</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходСпециальноеОборудование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНормыРасходаГСМ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыНормРасходаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаГорнаяМестность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаГрузовой</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаДлительнаяЭксплуатация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаЗимний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаКлиматКонтроль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаКондиционер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаНаселенныйПункт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаОтопитель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаПростой</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаСложностьДорог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаСпециальноеОборудование</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьТемпературуВоздухаВПутевомЛисте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаТемпературныхКоэффициентов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упОценочнаяШкала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходРабочаяОперация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасходаРабочаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упОбъектыНормРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упОбъектыНормРасходаГСМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыНормРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыНормРасходаГСМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСтоКилометров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОдинЧасРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упУстановкаНормРасходаГСМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.упУстановкаНормРасходаГСМ.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	Если ДополнительныеСвойства.Свойство("НормыРежимовРаботы") Тогда
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упНормыРасходаРежимовРаботы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ДополнительныеСвойства.НормыРежимовРаботы;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектНормРасхода", "ОбъектНормРасхода");
		упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;  
	КонецЕсли;
		
	РеквизитыОбъекта = Новый Структура(); 
	РеквизитыОбъекта.Вставить("ДатаНачалаДействия");
	РеквизитыОбъекта.Вставить("Организация");
	РеквизитыОбъекта.Вставить("Подразделение");
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("НормыТранспортныхСредств", 			НормыТранспортныхСредств.Выгрузить());
	РеквизитыОбъекта.Вставить("НормыДополнительногоОборудования", 	НормыДополнительногоОборудования.Выгрузить());
	
	упПутевойЛистУчетГСМ.СформироватьДвижениеНормыРасходаГСМ(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упПутевойЛистУчетГСМ.СформироватьДвижениеНормыРасходаРежимовРаботы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ОбъектНормРасходаГСМ = Перечисления.упОбъектыНормРасходаГСМ.ТранспортноеСредство Тогда
		ИмяРеквизита = "НормыДополнительногоОборудования";
	ИначеЕсли ОбъектНормРасходаГСМ = Перечисления.упОбъектыНормРасходаГСМ.ДополнительноеОборудование Тогда
		ИмяРеквизита = "НормыТранспортныхСредств";			
	КонецЕсли;
	текИндекс = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
	Если НЕ текИндекс = Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(текИндекс);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыФункции

Процедура ЗаполнитьНормыРасходаГСМ(мсвНомераСтрокТабличнойЧасти, НормаРасходаГСМ = Неопределено) Экспорт
	
	Если мсвНомераСтрокТабличнойЧасти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЭтоОбъектРасчетаНормыТС = ОбъектНормРасходаГСМ = Перечисления.упОбъектыНормРасходаГСМ.ТранспортноеСредство;
	Если ЭтоОбъектРасчетаНормыТС Тогда
		ТабличнаяЧасть = НормыТранспортныхСредств;
	Иначе	
		ТабличнаяЧасть = НормыДополнительногоОборудования;
	КонецЕсли;	
	
	// Если не задана норма расхода.
	Если НормаРасходаГСМ = Неопределено Тогда
		
		// Строки табличной части "Нормы" заполняются по РС.упНормыРасходаГСМ.
		
		Запрос.Текст = "ВЫБРАТЬ
		|	втТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
		|	втТабличнаяЧасть.Организация КАК Организация,
		|	втТабличнаяЧасть.Подразделение КАК Подразделение,
		|	втТабличнаяЧасть.ВидГСМ КАК ВидГСМ,
		|	втТабличнаяЧасть.ОбъектНормРасхода КАК ОбъектНормРасхода
		|ПОМЕСТИТЬ втНормы
		|ИЗ
		|	&ТабличнаяЧасть КАК втТабличнаяЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбНормыРасхода.*,
		|	втНормы.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	втНормы КАК втНормы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упНормыРасходаГСМ.СрезПоследних(
		|				,
		|				(Организация, Подразделение, ОбъектНормРасхода, ВидГСМ) В
		|					(ВЫБРАТЬ
		|						втНормы.Организация КАК Организация,
		|						втНормы.Подразделение КАК Подразделение,
		|						втНормы.ОбъектНормРасхода КАК ОбъектНормРасхода,
		|						втНормы.ВидГСМ КАК ВидГСМ
		|					ИЗ
		|						втНормы КАК втНормы)) КАК тбНормыРасхода
		|		ПО втНормы.Организация = тбНормыРасхода.Организация
		|			И втНормы.Подразделение = тбНормыРасхода.Подразделение
		|			И втНормы.ВидГСМ = тбНормыРасхода.ВидГСМ
		|			И втНормы.ОбъектНормРасхода = тбНормыРасхода.ОбъектНормРасхода";
		
		
		ИмяПоляОбъектНормРасхода = "";
				
		Если ЭтоОбъектРасчетаНормыТС Тогда
			тбзНормы = ТабличнаяЧасть.ВыгрузитьКолонки("НомерСтроки, ТранспортноеСредство, ВидГСМ");
			тбзНормы.Колонки.Добавить("ОбъектНормРасхода", 	Новый ОписаниеТипов("СправочникСсылка.упТранспортныеСредства")); 	
			ИмяПоляОбъектНормРасхода = "ТранспортноеСредство";
		Иначе	
			тбзНормы = ТабличнаяЧасть.ВыгрузитьКолонки("НомерСтроки, ДополнительноеОборудование, ВидГСМ");
			тбзНормы.Колонки.Добавить("ОбъектНормРасхода", 	Новый ОписаниеТипов("СправочникСсылка.упДополнительноеОборудование"));
			ИмяПоляОбъектНормРасхода = "ДополнительноеОборудование";
		КонецЕсли;	
		
		тбзНормы.Колонки.Добавить("Организация",	Новый ОписаниеТипов("СправочникСсылка.Организации")); 
		тбзНормы.Колонки.Добавить("Подразделение", 	Новый ОписаниеТипов("СправочникСсылка.упСтруктураПредприятия")); 		
		
		Для каждого ЭлементНомерСтроки Из мсвНомераСтрокТабличнойЧасти Цикл
			Строка = ТабличнаяЧасть.Получить(ЭлементНомерСтроки - 1);
			НоваяСтрока = тбзНормы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ОбъектНормРасхода = Строка[ИмяПоляОбъектНормРасхода];	
			НоваяСтрока.Организация		= Организация;
			НоваяСтрока.Подразделение	= Подразделение;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ТабличнаяЧасть", тбзНормы);
		
		Выборка	= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Строка = ТабличнаяЧасть.Получить(Выборка.НомерСтроки - 1);
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			Если Строка.ТипНормыРасходаГСМ = Перечисления.упТипыНормРасходаГСМ.НаОдинЧасРаботы Тогда
					Строка.ИзменениеРасхода = 0;
			КонецЕсли;
		КонецЦикла; 
		
	Иначе	
		
		// Строки табличной части "Нормы" заполняются данными заданной нормы.
		
		Запрос.Текст = "ВЫБРАТЬ
		|	НормыРасходаГСМ.*
		|ИЗ
		|	Справочник.упНормыРасходаГСМ КАК НормыРасходаГСМ
		|ГДЕ
		|	НормыРасходаГСМ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", НормаРасходаГСМ);
		
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Для каждого ЭлементНомерСтроки Из мсвНомераСтрокТабличнойЧасти Цикл
				Строка = ТабличнаяЧасть.Получить(ЭлементНомерСтроки - 1);
				ЗаполнитьЗначенияСвойств(Строка, Выборка);
				Если Строка.ТипНормыРасходаГСМ = Перечисления.упТипыНормРасходаГСМ.НаОдинЧасРаботы Тогда
					Строка.ИзменениеРасхода = 0;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
